<a href="https://colab.research.google.com/github/litlife8582/Pandas/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

Creating a pandas list

In [ ]:
my_series=[5,9,12,27]
my_var=pd.Series(my_series)
my_var

0     5
1     9
2    12
3    27
dtype: int64

In [ ]:
my_var[2]

np.int64(12)

Putting index to out data values

In [ ]:
my_index=["A","B","C","D"]
my_var2=pd.Series(my_series,my_index)
my_var2

A     5
B     9
C    12
D    27
dtype: int64

In [ ]:
my_var2["B"]

np.int64(9)

Using python dictionary

In [ ]:
cars={"Tesla":12,
      "Mercedes":42,
      "BMW":3}

my_var3=pd.Series(cars)
my_var3

Tesla       12
Mercedes    42
BMW          3
dtype: int64

Data Frames